package com.example.sanguo;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;

import java.util.ArrayList;
import java.util.List;

class MyDatabaseManager {

    private SQLiteDatabase database;
    MyDatabaseManager(Context context)
    {
        MyDatabaseHelper myDatabaseHelper;
        myDatabaseHelper = new MyDatabaseHelper(context);
        database = myDatabaseHelper.getWritableDatabase();
    }

    boolean add(Humans human, String table)
    {
        Cursor cursor = database.rawQuery("SELECT * FROM " + table + " WHERE name = \'" + human.name + "\'",null);
        if(cursor.getCount() == 0)
        {
            ContentValues values=new ContentValues();
            values.put("name",human.name);
            values.put("nation",human.nation);
            values.put("gender",human.gender);
            values.put("nativePlace",human.nativePlace);
            values.put("birth",human.birth);
            values.put("dead",human.dead);
            values.put("imageId",human.imageId);
            values.put("introduction",human.introduction);
            database.insert(table,null,values);
            cursor.close();
            return true;
        }
        cursor.close();
        return false;
    }

    void delete(Humans humans)
    {
        database.execSQL("DELETE FROM collect WHERE name = \'" + humans.name + "\'");
    }

    List<Humans> query(String input,String table )
    {
        Cursor cursor;
        List<Humans> selectHumans;
        cursor = database.rawQuery("SELECT * FROM " + table + " WHERE name LIKE '%" + input + "%'",null);
        selectHumans = get(cursor);
        cursor = database.rawQuery("SELECT * FROM " + table + " WHERE nation LIKE '%" + input + "%'",null);
        merageList(selectHumans,get(cursor));
        cursor = database.rawQuery("SELECT * FROM " + table + " WHERE nativePlace LIKE '%" + input + "%'",null);
        merageList(selectHumans,get(cursor));
        cursor = database.rawQuery("SELECT * FROM " + table + " WHERE birth = '" + input + "' OR dead = '" + input + "'",null);
        merageList(selectHumans,get(cursor));
        return  selectHumans;

    }
    List<Humans> getALL(String table)
    {
        Cursor cursor = database.rawQuery("SELECT * FROM " + table,null);
        return get(cursor);
    }

    private void merageList(List<Humans> listOne, List<Humans> listTwo)
    {
        int l2 = listTwo.size();
        int l1 = listOne.size();
        for(int i = 0; i < l2; i++)
        {
            boolean have = false;
            for(int j = 0; j < l1; j++)
            {
                if(listTwo.get(i).name.equals(listOne.get(j).name)) have = true;
            }
            if(!have) listOne.add(new Humans(listTwo.get(i)));
        }
    }

    private List<Humans> get(Cursor cursor)
    {
        List<Humans> allHumans = new ArrayList<>();
        while (cursor.moveToNext()) {
            Humans human = new Humans();
            human.name = cursor.getString(cursor.getColumnIndex("name"));
            human.nation = cursor.getString(cursor.getColumnIndex("nation"));
            human.gender = cursor.getString(cursor.getColumnIndex("gender"));
            human.nativePlace = cursor.getString(cursor.getColumnIndex("nativePlace"));
            human.introduction = cursor.getString(cursor.getColumnIndex("introduction"));
            human.birth = cursor.getString(cursor.getColumnIndex("birth"));
            human.dead = cursor.getString(cursor.getColumnIndex("dead"));
            human.imageId = cursor.getInt(cursor.getColumnIndex("imageId"));
            human.years = String.valueOf(human.birth) + "年-" + String.valueOf(human.dead) + "年";
            allHumans.add(human);
        }
        cursor.close();
        return  allHumans;
    }

    void initial(String table)
    {
        Cursor cursor = database.rawQuery("SELECT * FROM " + table,null);
        if(cursor.getCount() == 0 && table.equals("human"))
        {
            add(new Humans("刘备","蜀","男","161","223","涿郡涿县",R.drawable.liubei,"刘备（161年－223年6月10日），即汉昭烈帝（221年—223年在位），字玄德，东汉末年幽州涿郡涿县（今河北省涿州市）人，西汉中山靖王刘胜的后代，三国时期蜀汉开国皇帝、政治家，史家又称他为先主。刘备少年时拜卢植为师；早年颠沛流离，备尝艰辛，投靠过多个诸侯，曾参与镇压黄巾起义。先后率军救援北海相孔融、徐州牧陶谦等。陶谦病亡后，将徐州让与刘备。赤壁之战时，刘备与孙权联盟击败曹操，趁势夺取荆州。而后进取益州。于章武元年（221年）在成都称帝，国号汉，史称蜀或蜀汉。《三国志》评刘备的机权干略不及曹操，但其弘毅宽厚，知人待士，百折不挠，终成帝业。刘备也称自己做事“每与操反，事乃成尔”。"),table);
            add(new Humans("孙尚香","吴","女","？","？","扬州吴郡富春",R.drawable.sunshangxiang,"演义中为孙尚香。孙尚香之名为日后戏曲所创作出来的。刘备向东吴借荆州不还，鲁肃身负关系；周瑜一为救友，二为国计，于是上书孙权，教使「美人计」，进妹予刘备为夫人，诱其丧志而疏远属下。孙夫人才捷刚猛，有诸兄之风，身边侍婢百余人，皆亲自执刀侍立。不料在诸葛亮的锦囊妙计安排下，假婚成真姻；后来夫人更助刘备返蜀，于路上怒斥追袭的吴将。后刘备入益州，使赵云领留营司马，留守荆州。此时孙权闻知刘备西征，于是遣周善引领舟船以迎孙夫人，而夫人带着后主刘禅回吴，幸得赵云与张飞勒兵截江，方重夺刘禅。彝陵之战，刘备战败，有讹言传入吴中，道刘备已死，孙夫人伤心不已，望西痛哭，投江而死。后人为其立庙，号曰「枭姬庙」。"),table);
            add(new Humans("貂蝉","群","女","？","？","虚构",R.drawable.diaochan,"舍身报国的可敬女子，她为了挽救天下黎民，为了推翻权臣董卓的荒淫统治，受王允所托，上演了可歌可泣的连环计（连环美人计），周旋于两个男人之间，成功的离间了董卓和吕布，最终吕布将董卓杀死，结束了董卓专权的黑暗时期。"),table);
            add(new Humans("袁术","群","男","？","199","豫州汝南郡汝阳",R.drawable.yuanshu,"汉末军阀。他的家族四代中有五人位居三公，是当世的大豪族。大将军何进被十常侍所杀，袁术与他堂兄袁绍等诛杀宦官立下大功。因董卓祸国，十八路诸侯聚讨董卓，袁术以第一镇诸侯的身份参与。同盟解散，袁术为了除掉刘备，派遣使者想和吕布结亲，吕布将使者送给曹操斩首。当时袁术得到孙策手中的传国玉玺，又以自己的名字应谶言\"代汉者当涂高\"，就称帝于寿春。得知吕布送斩他的使者，就发兵攻打他，却反被吕布所破。曹操又会合吕布、刘备、孙策等讨伐袁术。袁术大败，逃到淮南，因他奢侈过度，不懂体恤军民，导致众叛亲离，就将帝号归于袁绍，想从徐州北上。曹操就派刘备拦截袁术，大破袁术军。各地盗贼也屡屡劫掠袁术，粮食没了，家人很多都被饿死，就屯在江亭。想取蜜水止渴，听了庖人只有血水而没有蜜水的话后，大叫一声倒地吐血而死。"),table);
            add(new Humans("郭嘉","魏","男","170","207","豫州颍川郡阳翟",R.drawable.guojia,"经程昱提及，荀文若把郭嘉推荐给曹操。郭嘉多为行军参谋，经常出奇策良谋。在曹操回援兖州时，提醒泰山险路可能有埋伏。于下邳攻坚不下的时候，献上大水淹城计，将吕布击破，于白门楼擒之。后来在许昌劝曹操软禁刘备，惜曹操未用其谋，刘备走脱。在曹操准备攻打袁绍，孙策却趁机预谋袭击时，分析孙策为人不谨慎，迟早会被小人所杀。于曹操攻打河北战役中多做贡献，在袁绍死后，袁谭与袁尚权力相并，郭嘉献计使其自相残杀。此计策为平定河北立下殊勋，极大地消耗了袁氏一族的军事实力。在扫情袁熙、袁尚余党时，谏曹操快速袭击乌桓，兵贵神速，使得张辽一战斩蹋顿。后来因为水土不服，在远征中病倒，被曹操送到易州养病。病危之际为曹操写下剿灭袁氏余党的计谋，这就是遗计定辽东。死后曹操伤心不已，手下诸将及谋士也都扼腕而叹。赤壁战败，曹操更是痛哭郭嘉，感叹若奉孝在，不至有此败。这强烈的表达出曹操对人才的珍惜（也有惭愧众谋士的意思），当然侧面也表现出郭嘉对于曹操的重要性。"),table);
            add(new Humans("祝融","群","女","？","？","虚构",R.drawable.zhurong,"南蛮王孟获之妻、祝融氏之后。夫人使丈八长标，背插五口飞刀，百发百中。三江城为蜀相诸葛亮所得，夫人替夫出阵，以飞刀伤张嶷之手，又擒马忠，生擒二将。后为赵云、魏延挑衅，深入敌，旋即为马岱以绊马索擒下。获以张、马二将换回夫人。后亮七擒七纵获，获表示永不再反，夫人亦随之投降。"),table);
            add(new Humans("袁绍","群","男","？","202","豫州汝南郡汝阳",R.drawable.yuanshao,"初为何进党羽。何进被杀后，与袁术等共同诛杀宦官。董卓夺权，残暴不仁，涂炭生灵。袁绍奔冀州组成十七路诸侯反董卓联合。董卓迁都于长安后，便引诱公孙瓒进攻冀州，随后胁迫韩馥控制冀州。随后为扩大势力范围而相继占领青州、并州。于歼灭公孙瓒之后平定幽州，于河北建立起庞大的势力。为与曹操一决雌雄，遣七十万的兵越过黄河，之后却于官渡之战中被火烧乌巢，惨遭落败。之后与曹操在仓亭决战，败归后不久病死"),table);
            add(new Humans("典韦","魏","男","？","197","陈留己吾",R.drawable.dianwei,"东汉末年曹操部将，相貌魁梧，膂力过人。本属张邈，后归曹操。曹操征讨吕布时被募为陷阵，表现英勇，被拜为校尉，宿卫曹操。建安二年（197年），张绣背叛曹操，典韦为保护曹操而独挡叛军，击杀多人，但最终因寡不敌众而战死。"),table);
            add(new Humans("荀彧","魏","男","163","212","颍川颍阴",R.drawable.xunyu,"荀彧早年被称为“王佐之才”，初举孝廉，任守宫令。后弃官归乡，又率宗族避难冀州，被袁绍待为上宾。其后投奔曹操。官至侍中，守尚书令，封万岁亭侯。因其任尚书令，居中持重达十数年，处理军国事务，被人敬称为“荀令君”。后因反对曹操称魏公而受曹操所忌，调离中枢，在寿春忧郁成病而亡（一说服毒自尽），年五十。获谥敬侯，后追赠太尉。"),table);
            add(new Humans("孙坚","吴","男","155","191","吴郡富春",R.drawable.sunjian,"史书说他“容貌不凡，性阔达，好奇节”。曾参与讨伐黄巾军的战役以及讨伐董卓的战役。后与刘表作战时阵亡。因官至破虏将军，又称“孙破虏”。其子孙权即为孙吴的开国皇帝。孙权称帝后，追谥孙坚为武烈皇帝。"),table);
            add(new Humans("庞统","蜀","男","179","214","汉时荆州襄阳",R.drawable.pangtong,"东汉末年刘备帐下重要谋士，与诸葛亮同拜为军师中郎将。与刘备一同入川，于刘备与刘璋决裂之际，献上上中下三条计策，刘备用其中计。进围雒县时，庞统率众攻城，不幸中流矢而亡，年仅三十六岁，追赐统为关内侯，谥曰靖侯。后来庞统所葬之处遂名为落凤坡。"),table);
            add(new Humans("孟获","蜀","男","？","？","益州益州郡",R.drawable.menghuo,"南蛮大王。建兴三年，获大起蛮兵十万造反。丞相诸葛亮引军五月渡泸，深入不毛之地，智破蛮军，七擒获。获自知羞惭，遂举族拜降，永不复反"),table);
            add(new Humans("徐庶","魏","男","？","？","颍川郡长社县",R.drawable.xushu,"徐庶本名徐福，为寒门子弟。早年为人报仇，获救后改名徐庶，求学于儒舍。后与同郡石广元避难于荆州，与司马徽、诸葛亮、崔州平等道友来往密切。刘备屯驻新野时，徐庶前往投奔，并向刘备推荐诸葛亮。徐庶南下时因母亲被曹操所掳获，徐庶不得已辞别刘备，进入曹营。后来此事被艺术加工为“徐庶进曹营，一言不发”等歇后语，被广为流传。而徐庶也成为孝子的典范被加以称赞。魏文帝时，徐庶官至右中郎将、御史中丞。"),table);
            add(new Humans("孙策","吴","男","175","200","吴郡富春",R.drawable.sunce,"为继承父亲孙坚的遗业而屈事袁术，兴平二年（195年），孙策征得袁术许可，准备东渡长江，横江进攻樊能、于糜，又在当利口袭击张英。孙策来到曲阿并以曲阿为据点，与扬州刺史刘繇进行决战曲阿之战，大败刘繇。建安元年（196年）孙策率兵进攻会稽王朗和吴郡严白虎。建安二年（197年），袁术僭越称帝后，孙策与袁术决裂。建安二年（197年）夏，曹操下诏书给孙策，要孙策讨伐袁术，任命他为骑都尉，袭父爵乌程侯，兼任会稽太守，曹操奏许朝廷任命策为讨逆将军，并封为吴侯，后统一江东。孙策为将，有智有勇，英姿勃发，其治军严整，军纪严明。但在征战中由于年轻气盛，难免出现处事不慎、好勇斗狠的弱点，这为其结怨和遇刺种下了祸根。"),table);
            add(new Humans("马超","蜀","男","176","222","扶风茂陵",R.drawable.machao,"汉伏波将军马援的后人，马腾的儿子，少年成名，曹操曾多次征召马超入京为官，但都被马超拒绝。而后马腾入京被封为卫尉，马超就统领了马腾的部队。"),table);
            add(new Humans("程昱","魏","男","141","220","兖州东郡东阿",R.drawable.chengyu,"东汉后期至三国时期曹魏谋士、名臣。本名程立，因梦中在泰山捧日，更名程昱。曾于东阿率领民众抗击黄巾。初平三年（192年），被曹操征辟为寿张令，从此为其出谋献策、征战四方。"),table);
            add(new Humans("夏侯惇","魏","男","？","220","沛国谯",R.drawable.xiahoudun,"少年时以勇气闻名于乡里。曹操起兵，夏侯惇是其最早的将领之一。与吕布军交战时，曾一度被擒为人质，又被流矢射瞎左眼。多次为曹操镇守后方，曾率军民阻断太寿河水，筑陂塘灌溉农田，使百姓受益，功勋卓著。历任折冲校尉、济阴太守、建武将军，官至大将军，封高安乡侯，追谥忠侯。青龙元年（233年），得以配享太祖（曹操）庙庭。"),table);
            add(new Humans("刘表","群","男","142","208","山阳郡高平",R.drawable.liubiao,"刘表身长八尺余，姿貌温厚伟壮，少时知名于世，名列“八俊”。早年为大将军何进辟为掾，出任北军中候。后代王睿为荆州刺史，用蒯氏兄弟、蔡瑁等人为辅。李傕等入长安，刘表遣使奉贡，被任命为镇南将军、荆州牧、假节，封成武侯。在荆州期间，刘表恩威并著，招诱有方，使得万里肃清、群民悦服。又开经立学，爱民养士，从容自保。远交袁绍，近结张绣，内纳刘备，据地数千里，带甲十余万，称雄荆江，先杀孙坚，后又常抗曹操。然而刘表为人性多疑忌，好于坐谈，立意自守，而无四方之志，后更宠溺后妻蔡氏，使妻族蔡瑁等得权。"),table);
            add(new Humans("黄忠","蜀","男","？","220","南阳",R.drawable.huangzhong,"本为刘表部下中郎将，后归刘备，并助刘备攻益州刘璋。建安二十四年（219年），黄忠在定军山一战中阵斩曹操部下名将夏侯渊，升任征西将军，刘备称汉中王后改封后将军，赐关内侯。次年，黄忠病逝。景耀三年（260年），追谥刚侯。黄忠在后世多以勇猛的老将形象出现于各类文学艺术作品中，《三国演义》里，刘备称汉中王后将其封为五虎上将之一，而黄忠的名字在中国也逐渐成为了老当益壮的代名词。"),table);
            add(new Humans("鲁肃","吴","男","172","217","临淮郡东城县",R.drawable.lusu,"中国东汉末年杰出战略家、外交家。出生于一士族家庭；幼年丧父，由祖母抚养长大。他体貌魁伟，性格豪爽，喜读书、好骑射。东汉末年，他眼见朝廷昏庸，官吏腐败，社会动荡，常召集乡里青少年练兵习武。他还仗义疏财，深得乡人敬慕。当时，周瑜为居巢长，因缺粮向鲁肃求助，鲁肃将一仓三千斛粮食慷慨赠给周瑜。从此，二人结为好友，共谋大事。"),table);
            add(new Humans("许褚","魏","男","？","？","谯国谯人",R.drawable.xuchu,"年轻时在家乡聚集了数千户人家，共同抵御贼寇。曾有一次因缺粮与贼寇用牛交换粮食，牛到了对方手中后又跑了回来，结果许褚单手倒拖牛尾走了百步，贼寇大惊，不敢要牛就走了。从此淮、汝、陈、梁之地，听到许褚之名都感到畏惧。"),table);
            add(new Humans("公孙瓒","群","男","？","199","辽西令支",R.drawable.gongsunzan,"公孙瓒出身贵族。因母地位卑贱，只当了郡中小吏。因其相貌俊美，且声音洪亮、机智善辩，得到涿郡太守赏识，将女儿许配给他。后逐步做到中郎将，以强硬的态度对抗北方游牧民族，作战勇猛，威震边疆。"),table);
            add(new Humans("张辽","魏","男","169","222","雁门马邑",R.drawable.zhangliao,"汉末三国时期曹魏名将。曾从属丁原、董卓、吕布。吕布下邳败亡后，归顺曹操。此后随曹操四处征讨，战功累累。"),table);
            add(new Humans("贾诩","魏","男","147","223","凉州姑臧",R.drawable.jiaxu,"东汉末年至三国初年著名谋士、军事战略家，曹魏开国功臣。原为董卓部将，董卓死后，献计李傕、郭汜反攻长安。李傕等人失败后，辗转成为张绣的谋士。张绣曾用他的计策两次打败曹操，官渡之战前他劝张绣归降曹操。"),table);
            add(new Humans("太史慈","群","男","166","206","东莱黄县",R.drawable.taishici,"东汉末年名将，官至建昌都尉。弓马熟练，箭法精良。原为刘繇[yáo]部下，后被孙策收降，自此太史慈为孙氏大将，助其扫荡江东。孙权统事后，因太史慈能制刘磐[pán]，便将管理南方的要务委托给他。建安十一年（206年）太史慈逝世，死前说道：“丈夫生世，当带三尺之剑，以升天子之阶。今所志未从，奈何而死乎！”（《吴书》，《三国演义》为“大丈夫生于乱世，当带三尺剑立不世之功；今所志未遂，奈何死乎！”）言讫而亡，年四十一岁。"),table);
            add(new Humans("丁原","群","男","？","189","并州",R.drawable.dingyuan,"东汉末年人物，官拜执金吾，领并州刺史，汉灵帝驾崩后，受何进之邀，入洛阳诛杀十常侍，未至，何进已被宦官所杀。之后，丁原与董卓发生冲突，董卓得知丁原手下大将吕布唯利是图并未得重用，便遣使挑拨诱使吕布将其杀害。"),table);
            add(new Humans("甘宁","吴","男","？","220","巴郡临江",R.drawable.ganning,"建安十三年（208年），甘宁率部投奔孙权，开始建功立业。先后随孙权破黄祖据楚关，随周瑜攻曹仁取夷陵，随鲁肃镇益阳拒关羽，守西陵、擒朱光，率百余人夜袭曹营，战功赫赫。孙权曾说：“孟德有张辽，孤有甘兴霸，足相敌也。”他为人仗义疏财，深得士卒拥戴，被陈寿盛赞为“江表之虎臣”。"),table);
            add(new Humans("陈宫","群","男","？","199","东郡东武阳",R.drawable.chengong,"性情刚直，足智多谋，年少时与海内知名之士相互结交。192年，兖州刺史刘岱在讨伐青州黄巾时战死，陈宫等人主张曹操接任兖州牧因而被曹操视为心腹。但此后陈宫因曹操杀害边让等汉末名士而与曹操反目，并游说张邈背叛曹操迎吕布入兖州，辅助吕布攻打曹操并先后取得兖州与徐州。下邳城中，吕布不听陈宫两面互补之计，以致失败。吕布战败后，随吕布等一同被曹操所擒，决意赴死。"),table);
            add(new Humans("姜维","蜀","男","202","264","天水冀县",R.drawable.jiangwei,"诸葛亮北伐时，姜维被怀疑有异心，姜维不得已投降蜀汉，被诸葛亮重用。诸葛亮去世后姜维在蜀汉开始崭露头角，费祎死后姜维开始独掌军权，继续率领蜀汉军队北伐曹魏，与曹魏名将邓艾、陈泰、郭淮等多次交手，姜维北伐总计大胜两次；小胜三次；相距不克四次；大败一次，小败一次。后因蜀中大臣也多反对姜维北伐，而宦官黄皓弄权，姜维杀之不成，只得在沓中屯田避祸，后司马昭五道伐蜀，姜维据守剑阁，阻挡住钟会大军，却被邓艾从阴平偷袭成都，刘禅投降。后姜维希望凭自己的力量复兴蜀汉，假意投降魏将钟会，打算利用钟会反叛曹魏以实现恢复汉室的愿望，但最终钟会反叛失败，姜维与钟会一同被魏军所杀。"),table);
            add(new Humans("马腾","群","男","？","212","扶风茂陵",R.drawable.mateng,"马腾身长八尺馀，身体洪大，面鼻雄异，性格贤良忠厚，受众人尊敬。汉灵帝末年，被州郡署为军从事，掌领部众。累迁至偏将军。凉州刺史耿鄙为叛军所杀后，马腾与边章、韩遂等在凉州共同起事。"),table);
            add(new Humans("黄盖","吴","男","？","？","零陵泉陵",R.drawable.huanggai,"建安十三年（208年）赤壁之战时，黄盖前往曹营诈降，并趁机以火攻大破曹操的军队，是赤壁之战主要功臣之一，以功拜武锋中郎将，他也因为此事迹而被后人广为传颂，小说《三国演义》在刻画黄盖这一人物时描写了“苦肉计”的故事。不久武陵蛮夷反，攻打城邑，黄盖以五百人，放其半入，拦腰截击，大破诸贼。春去夏来，寇乱尽平。后又平讨长沙益阳县山贼，加偏将军。官至偏将军、武陵太守。有一子黄柄。"),table);
            add(new Humans("法正","蜀","男","176","220","扶风郿",R.drawable.fazheng,"原为刘璋部下，刘备围成都时劝说刘璋投降，而后又与刘备进取汉中，献计将曹操大将夏侯渊斩首。法正善奇谋，深受刘备信任和敬重。"),table);
            add(new Humans("徐晃","魏","男","？","227","河东杨",R.drawable.xuhuang,"三国时期曹魏名将。本为杨奉帐下骑都尉，杨奉被曹操击败后转投曹操，在曹操手下多立功勋，参与官渡、赤壁、关中征伐、汉中征伐等几次重大战役。樊城之战中徐晃作为曹仁的援军击败关羽，因于此役中治军严整而被曹操称赞“有周亚夫之风”。曹丕称帝后，徐晃被加为右将军，于公元227年病逝，谥曰壮侯。"),table);
            add(new Humans("大乔","吴","女","180","？","庐江郡皖县",R.drawable.daqiao,"江东乔国老有二女，大乔和小乔。大乔有沉鱼落雁之资，倾国倾城之容。孙策征讨江东，攻取皖城，娶大乔为妻。自古美女配英雄，伯符大乔堪绝配。曹操赤壁鏖兵，虎视江东，曾有揽二乔娱暮年，还足平生之愿。"),table);
            add(new Humans("张角","群","男","？","184","钜鹿",R.drawable.zhangjiao,"中国东汉末年农民起义军“黄巾军”的领袖，太平道的创始人。他因得到道士于吉等人所传《太平清领书》（即《太平经》），遂以宗教救世为己任，利用其中的某些宗教观念和社会政治思想，组织群众，约于灵帝建宁（168－172）初传道。"),table);
            add(new Humans("庞德","魏","男","？","219","南安郡狟道",R.drawable.pangde,"约在初平年间，投奔马腾帐下，在平定羌民的征伐中屡立战功。建安年间，庞德跟随马超征战平阳，抵御袁将郭援、高干，在马上亲斩郭援首级。张白骑在弘农反叛时，庞德也参与战斗。每次出征常冲锋陷阵，勇冠凉州三军。后几经辗转，随张鲁归降于曹操麾下，被授官立义将军，封关内亭侯，食邑三百户。"),table);
            add(new Humans("陆逊","吴","男","183","245","吴郡吴县",R.drawable.luxun,"建安八年（203年），入孙权幕府，历任海昌屯田都尉、定威校尉、帐下右部督。建安二十四年（219年），陆逊参与袭取荆州。章武二年（222年），孙权以陆逊为大都督，在夷陵火烧连营击败刘备，一战成名。黄武七年（228年），陆逊取得石亭之战的胜利。黄龙元年（229年），孙权称帝后，以陆逊为上大将军、辅佐太子孙登并掌管陪都武昌事宜后卷入立嗣之争。赤乌七年（244年）拜为丞相、荆州牧、右都护、总领三公事务，领武昌事。次年去世，终年六十三岁，追谥昭侯。"),table);
            add(new Humans("魏延","魏","男","？","234","义阳",R.drawable.weiyan,"刘备入川时魏延因数有战功被任命为牙门将军，刘备攻下汉中后又将其破格提拔为镇远将军，领汉中太守，镇守汉中，成为独当一方的大将。魏延镇守汉中近十年，之后又屡次随诸葛亮北伐，功绩显著。期间魏延多次请诸葛亮给他统领一万兵，另走一路攻关中，最后与诸葛亮会师于潼关，如同韩信的例子，但诸葛亮一直不许，因而认为自己无法完全发挥才能，心怀不满。 与长史杨仪不和，诸葛亮死后，两人矛盾激化，相互争权，魏延败逃，为马岱所追斩，并被夷灭三族。"),table);
            add(new Humans("小乔","吴","女","180","？","庐江皖县",R.drawable.xiaoqiao,"周瑜风度翩翩的才子形象，与堪称国色的小桥可称天作之合，由此成为后世文艺作品的对象。唐代著名诗人杜牧激发想象，一句“东风不与周郎便，铜雀春深锁二乔“将小桥与赤壁之战联系起来。而令“”二桥“”闻名于世。"),table);
            add(new Humans("何进","群","男","？","189","南阳宛",R.drawable.hejin,"东汉灵帝时外戚，官至大将军。何进的异母妹有宠于灵帝并被立为皇后，他也随之升迁。黄巾起义时，何进为大将军，总镇京师，因及时发现并镇压了马元义的密谋，被封为慎侯。为张大威望，何进请灵帝在京师讲武结营，置西园禁军校尉。灵帝驾崩后，蹇硕谋诛进而立皇子刘协，未果，反被进诛。何进从袁绍之言，博征智谋之士为己所用。自此独揽大权。然而何进不纳陈琳之谏，多结外镇军阀，翘首京师，与袁绍等谋诛宦竖。终于事泄，被张让等先下手为强，遭杀身之祸。"),table);
            add(new Humans("曹仁","魏","男","168","223","沛国谯",R.drawable.caoren,"曹仁好弓马骑射，少时不修行检，及至长成为大将，则变得严整，奉法守令。从曹操多年，为魏朝立下汗马功劳。破袁术，曹仁所斩获颇多，大破陶谦军及陶谦部将吕由，攻克句阳，生擒吕布的部将刘何，官渡之战中，在隐强打败刘备军、鸡落山之战又战胜袁绍军。"),table);
            add(new Humans("田丰","群","男","？","200","钜鹿",R.drawable.tianfeng,"东汉末年袁绍部下谋臣，官至冀州别驾。其为人刚直，曾多次向袁绍进言而不被采纳，曹操部下谋臣荀彧曾评价他“刚而犯上”。后因谏阻袁绍征伐曹操而被袁绍下令监禁。官渡之战后，田丰被袁绍杀害。"),table);
            add(new Humans("周泰","吴","男","？","？","九江下蔡",R.drawable.zhoutai,"孙策平定江东时与同郡蒋钦一起加入孙策军，随孙策左右，后孙权爱其为人，向孙策请求让周泰跟随自己。周泰多次于战乱当中保护孙权的安危，身上受的伤多达几十处，就像在皮肤上雕画一样，吴将朱然、徐盛等因此对其拜服。后来孙权为了表彰周泰为了东吴出生入死的功绩，而赐给他青罗伞盖。官至汉中太守、奋威将军，封陵阳侯。死于黄武中年，有子周邵，亦数有战功，死于黄龙二年，周邵的弟弟周承继承了兵权和爵位。"),table);
            add(new Humans("黄月英","蜀","女","？","？","荆州沔南白水",R.drawable.huangyueying,"史称其长相丑陋，黄头发，黑皮肤，但才华却与诸葛亮相当 。并小说《三国演义》里，罗贯中也对其进行了描述。后世流传诸葛亮与黄月英的动人传说，不过并未有史书证实，为美好的臆想罢了。"),table);
            add(new Humans("张鲁","魏","男","？","216","沛国丰县",R.drawable.zhanglu,"东汉末年割据汉中一带的军阀，据传是西汉留侯张良的十世孙、天师道（五斗米道）教祖张陵之孙。张鲁为五斗米道的第三代天师（称系师），在杀张修后继续在汉中一带传播五斗米道，并自称“师君”。雄据汉中近三十年，后投降曹操，官拜镇南将军，封阆中侯，食邑万户。张鲁去世后谥号为“原”，葬于邺城东。"),table);
            add(new Humans("于禁","魏","男","？","221","泰山钜平",R.drawable.yujin,"本为鲍信部将，后属曹操，曾于张绣造反时讨伐不守军纪的青州兵，同时为迎击敌军而固守营垒，因此曹操称赞他可与古代名将相比。然而在建安二十四年（219年）的襄樊之战中，于禁在败给关羽后投降，致使晚节不保。关羽败亡后，于禁从荆州获释到了吴国。黄初二年（公元221年），孙权遣还于禁回魏，同年去世[1]  ，谥曰厉侯，有一子于圭。"),table);
            add(new Humans("吕蒙","吴","男","179","220","汝南富陂",R.drawable.lvmeng,"少年时依附姊夫邓当，随孙策为将。以胆气称，累封别部司马。孙权统事后，渐受重用，从破黄祖作先登，封横野中郎将。从围曹仁于南郡，破朱光于皖城，累功拜庐江太守。后进占荆南三郡，计擒郝普，在逍遥津之战中奋勇抵抗张辽军追袭，并于濡须数御魏军，以功除左护军、虎威将军。鲁肃去世后，代守陆口，设计袭取荆州，击败蜀汉名将关羽，使东吴国土面积大增，拜南郡太守，封孱陵侯，受勋殊隆。不久后因病去世，享年四十二岁。"),table);
            add(new Humans("严颜","群","男","？","？","益州牧刘璋巴郡",R.drawable.yanyan,"初为刘璋部下，担任巴郡太守。建安十九年，刘备进攻江州，严颜战败被俘，张飞对严颜说：“大军至，何以不降而敢拒战？”，严颜回答说：“卿等无状，侵夺我州，我州但有断头将军，无降将军也！”，张飞生气，命左右将严颜牵去砍头，严颜表情不变地说：“砍头便砍头，何为怒邪！”张飞敬佩严颜的勇气，遂释放严颜并以严颜为宾客，之后的事迹不在正史中出现。"),table);
            add(new Humans("蔡琰","魏","女","？","？","陈留郡圉县",R.drawable.caiyan,"东汉大文学家蔡邕的女儿。初嫁于卫仲道，丈夫死去而回到自己家里，后值因匈奴入侵，蔡琰被匈奴左贤王掳走，嫁给匈奴人，并生育了两个孩子。十二年后，曹操统一北方，用重金将蔡琰赎回，并将其嫁给董祀。"),table);
            add(new Humans("刘焉","群","男","？","194","江夏竟陵",R.drawable.liuyan,"西汉鲁恭王刘馀（汉景帝第五子）后裔，汉末群雄之一。以汉朝宗室身份，拜为中郎，历任雒阳令﹑冀州刺史﹑南阳太守﹑宗正﹑太常等官。后因益州刺史郄俭在益州大事聚敛，贪婪成风，加上当时天下大乱，刘焉欲取得一安身立命之所，割据一方。于是刘焉向朝廷求为益州牧，封阳城侯，前往益州整饬吏治。郄俭为黄巾贼所杀，刘焉进入益州，派张鲁盘踞汉中，张鲁截断交通，斩杀汉使，从此益州与中央道路不通。刘焉进一步对内打击地方豪强，巩固自身势力，益州因而处于半独立的状态。后因背疮迸发而卒，其子刘璋继领益州牧。"),table);
            add(new Humans("马岱","蜀","男","？","？","扶风茂陵",R.drawable.madai,"三国时期蜀汉将领，马超的从弟。早年追随马超大战曹操，反攻陇上，围攻成都，汉中之战等。后在诸葛亮病逝后受杨仪派遣斩杀了蜀将魏延。曾率领军队出师北伐，被魏将牛金击败而退还。官至平北将军，陈仓侯。"),table);
            add(new Humans("荀攸","魏","男","157","214","颍川颍阴",R.drawable.xunyou,"荀攸在何进掌权时期任黄门侍郎，在董卓进京时曾因密谋刺杀董卓而入狱，后弃官回家。 曹操迎天子入许都之后，荀攸成为曹操的军师。 曹操征伐吕布时荀攸劝阻了曹操退兵，并献奇计水淹下邳城，活捉吕布。官渡之战荀攸献计声东击西，斩杀颜良和文丑。又策奇兵，派徐晃烧袁绍粮草，同时力主曹操接纳许攸，画策乌巢，立下大功。平定河北期间，荀攸力排众议，主张曹操消灭袁绍诸子，被曹操上奏朝廷封为陵树亭侯。荀攸行事周密低调，计谋百出，深受曹操称赞。建安十九年（214年），荀攸在曹操伐吴途中去世。"),table);
            add(new Humans("华雄","群","男","？","191","？",R.drawable.huaxiong,"公元191年，关东军阀联合讨伐董卓，时任长沙太守的孙坚大破董卓军，华雄在此战中被孙坚一军所杀。明·罗贯中所著历史小说《三国演义》中则对这段历史作了改动，描写华雄被刘备二弟关羽所杀，这段被称为“温酒斩华雄”的故事情节也流传于后世。"),table);
            add(new Humans("王元姬","魏","女","217","268","东海郯县",R.drawable.wangyuanji,"王元姬幼时便通《诗经》、《论语》，嫁司马昭后竭尽妇道、谦虚谨慎。其人颇有远见，曾预言钟会谋反之事。泰始元年（265年），司马炎建立西晋，尊王元姬为皇太后，宫号曰崇化宫。王元姬身处太后之位，提倡节俭，身体力行，作为众妃子的表率。在其治理之下，后宫井井有条，众人和睦相处。"),table);
            add(new Humans("韩馥","群","男","？","191","颍川郡",R.drawable.hanfu,"韩馥担任过东汉的御史中丞，之后被董卓派为冀州牧；在各诸侯起兵讨伐董卓时，韩馥也是其中之一的参与者。韩馥与袁绍也曾经有意立刘虞为皇帝。"),table);
            add(new Humans("曹洪","魏","男","？","232","沛国谯",R.drawable.caohong,"曹洪早年随曹操起兵讨伐董卓。曹操于荥阳兵败失马时，曹洪舍命献马，并救护曹操，使其免于厄难。后多随军征伐，平兖州、征刘表、讨祝臂。官渡之战时，曹操令其驻守本阵。汉中之战时，与曹休在下辩抵御刘备，破斩吴兰、任夔，逼退张飞与马超。"),table);
            add(new Humans("沮授","群","男","？","200","广平",R.drawable.jushou,"史载他“少有大志，擅于谋略”。曾为冀州别驾，举茂才，并当过两次县令。后来又当韩馥别驾，被韩馥表为骑都尉。袁绍占据冀州后任用沮授为从事。经常对袁绍提出良策，但很多时候袁绍并不听从。官渡之战时袁绍大败，沮授未及逃走，被曹操所获，因拒降被曹操处死。"),table);
            add(new Humans("丁奉","吴","男","？","271","庐江安丰",R.drawable.dingfeng,"丁奉年少时以骁勇为小将，经常奋勇杀敌，屡立功勋，此后又于太元二年（252年）的东兴之战中“雪中奋短兵”，大破进犯东吴的魏军。吴景帝孙休在位时，丁奉设计除掉了东吴的权臣孙綝，被拜为大将军，后为右大司马、左军师，建衡三年（271年）去世。"),table);
            add(new Humans("甄姬","魏","女","183","221","中山无极",R.drawable.zhenji,"甄氏三岁丧父。建安中期，袁绍为次子袁熙纳之。建安四年（199年）袁熙出任幽州刺史，甄氏留在冀州侍奉袁绍的妻子刘氏。[2]  建安九年（204年），冀州邺城被曹操攻破，甄氏因有姿色，被曹丕所纳。甄氏初有宠于曹丕，生下儿子曹叡和女儿曹氏（即东乡公主）。甄氏对曹丕妾室中有宠的劝勉她们努力上进，对无宠的安慰开导，并常常建议曹丕为子孙昌盛多娶妻妾。[3]  早在曹丕初即王位时，便进郭女王为夫人，封号等同甄氏。到曹丕称帝，携郭女王到洛阳，进封贵嫔，地位仅次于皇后；甄氏则被留在邺城，仍为夫人，不立为皇后。甄氏愈发失意，有怨言"),table);
            add(new Humans("陶谦","群","男","132","194","丹阳郡",R.drawable.taoqian,"最初为诸生，在州郡任职，被举茂才，历任舒、卢二县令、幽州刺史、议郎，性格刚直，有大志。后随左车骑将军皇甫嵩对抗北宫伯玉，任扬武校尉，之后又随张温征韩遂、边章。"),table);
            add(new Humans("李典","魏","男","？","？","山阳郡钜野县",R.drawable.lidian,"李典深明大义，不与人争功，崇尚学习，尊敬儒雅，尊重博学之士，在军中被称为长者。李典有长者之风，官至破虏将军，三十六岁时去世。魏文帝曹丕继位后追谥号为愍侯。"),table);
            add(new Humans("李儒","群","男","？","？","不详",R.drawable.liru,"正史中是汉献帝时的弘农王郎中令，董卓专政时，奉董卓之命，入宫毒死刘辩 （弘农王）。董卓死后，李傕[jué]攻进长安，控制朝政，李傕推举博士李儒为侍中，但被汉献帝拒绝。198年李傕被曹操击败，李儒不知所踪。"),table);
            add(new Humans("邓艾","魏","男","197","264","义阳棘阳",R.drawable.dengai,"三国时期魏国杰出的军事家、将领。其人文武全才，深谙兵法，对内政也颇有建树。本名邓范，后因与同乡人同名而改名。邓艾多年在曹魏西边战线防备蜀汉姜维。"),table);
            add(new Humans("严白虎","群","男","？","？","吴郡乌程县",R.drawable.yanbaihu,"东汉末年盘据吴郡一带的地方豪帅，原名“严虎”，别号“白虎”，吴郡乌程县人，山贼出身的豪帅，严舆之兄。通俗小说《三国演义》则以“严白虎”为名，并且加上“东吴德王”的称号。"),table);
            add(new Humans("董荼那","蜀","男","？","？","南蛮五溪",R.drawable.dongtuna,"南蛮王孟获属下大将，第二洞元帅，与阿会喃等人一起担任孟获的援军出征，但是被俘虏，又被诸葛亮释放，孟获怀疑其叛变，将他杀死。"),table);
            add(new Humans("张松","蜀","男","？","212","蜀郡成都",R.drawable.zhangsong,"蜀郡成都（今四川成都）人[1]  。建安十三年（208年），为益州牧刘璋别驾从事，被派遣至曹操处而不为其所存录，因而怀怨恨。回蜀后，劝刘璋与曹操断绝关系，并说璋连好刘备；其后，又说璋迎备以击张鲁，皆为璋所采纳。建安十七年（212年），暗助刘备，为其兄张肃所告发，刘璋怒而将他斩杀。"),table);
            add(new Humans("张颌","魏","男","？","231","河间鄚",R.drawable.zhanghe,"东汉末年，应募参加镇压黄巾起义，后属冀州牧韩馥为军司马。191年，袁绍取冀州，张郃率兵投归，任校尉。因破公孙瓒有功，迁为宁国中郎将。后在官渡之战中投降曹操。此后，随曹操攻乌桓、破马超、降张鲁，屡建战功。继与都护将军夏侯渊留守汉中。215年，率军进攻巴西宕渠，被蜀将张飞击败。后任荡寇将军。219年，从夏侯渊迎战刘备军于定军山，当夏侯渊战死，全军危急之际，张郃代帅，率部安全撤退。后屯陈仓。"),table);
            add(new Humans("诸葛恪","吴","男","203","253","琅邪阳都",R.drawable.zhugege,"诸葛恪体格肥胖，幼小以神童著称，成人之后拜骑都尉，孙权长子孙登为太子时担任左辅都尉，作为东宫幕僚领袖辅佐太子理政。之后历任丹阳太守、威北将军等职，赤乌八年（公元245年）丞相陆逊病逝，诸葛恪升任大将军并代领其兵。神凤元年（公元252年）孙权病危时在孙峻的力荐下将诸葛恪任命为托孤大臣之首。孙亮即位后受封太傅。开始掌握吴国军政大权。执政初期革新政治，率军抗击魏国取得东兴大捷颇孚民望。并因功加封丞相[3]  、进爵阳都侯。"),table);
            add(new Humans("潘凤","群","男","？","？","不详",R.drawable.panfeng,"小说《三国演义》中的人物。擅使大斧。登场于小说第五回。冀州牧韩馥部下的上将。当十八路诸侯讨伐董卓之时，他奉韩馥之命前往汜水关前挑战董卓部下大将华雄，不敌被斩。"),table);
            add(new Humans("夏侯渊","魏","男","？","219","沛国谯",R.drawable.xiahouyuan,"初期随曹操征伐，官渡之战为曹操督运粮草，又督诸将先后平定昌豨、徐和、雷绪、商曜等叛乱。后率军驻凉州，逐马超、破韩遂、灭宋建、横扫羌、氐，虎步关右。张鲁降曹操后，夏侯渊留守汉中，与刘备相拒逾年，于定军山被刘备部将黄忠所袭，战死，谥曰愍侯。"),table);
            add(new Humans("司马师","魏","男","208","255","河内温县",R.drawable.simashi,"司马师沉着坚强，雄才大略，早年与夏侯玄、何晏齐名[1]  。高平陵之变后，以功封长平乡侯，旋加卫将军。司马懿死后，以抚军大将军辅政，独揽朝廷大权，次年升为大将军。掌权后，他制定选拔官吏的法规，命百官推荐贤才，整顿纲纪，使其各有职掌，朝野肃然。司马师也有卓越的军事才能，曾用计于新城之战击溃吴国诸葛恪的大军。"),table);
            add(new Humans("颜良","群","男","？","200","琅琊临沂",R.drawable.yanliang,"东汉末年河北军阀袁绍部将，以勇而闻名。建安四年（199年），袁绍以颜良、文丑为将，率精卒十万，准备攻许（今河南许昌）。建安五年（200年），兵进黎阳（今河南浚县），遣颜良攻白马（今河南滑县）。曹操北救，以荀攸计分兵渡河，引袁绍西应，自率轻兵掩袭白马，颜良仓猝逆战，被关羽击斩。"),table);
            add(new Humans("马良","蜀","男","187","222","襄阳宜城",R.drawable.maliang,"马良兄弟五人都有才华名气，而马良又在五人中最为出色，因此有“马氏五常，白眉最良”的赞誉。建安十四年（209年），刘备担任荆州牧，征召马良为州从事。马良与诸葛亮关系友善，曾奉命出使东吴，受到孙权恭敬的接待。"),table);
            add(new Humans("曹丕","魏","男","187","226","豫州沛国谯县",R.drawable.caopi,"曹丕自幼文武双全，博览经传，通晓诸子百家学说。建安二十二年（217年），曹丕击败了其弟曹植，被立为魏王世子。建安二十五年（220年），曹操逝世，曹丕继任丞相、魏王。同年，受禅登基，以魏代汉，结束了汉朝四百多年的统治，建立了魏国。曹丕在位期间，采纳吏部尚书陈群的意见，于黄初元年 （220年）命其制定九品中正制，成为魏晋南北朝时期主要的选官制度。而且平定了青州、徐州一带的割据势力，最终完成了北方的统一。对外平定边患，击退鲜卑，和匈奴、氐、羌等外夷修好，恢复在西域的建置。"),table);
            add(new Humans("文丑","群","男","？","200","不详",R.drawable.wenchou,"东汉末年冀州牧袁绍帐下的大将。建安五年（200年），袁绍命文丑率军于延津攻曹操，曹操以诱敌之计大破文丑一军，文丑于此战中丧生。明·罗贯中在小说《三国演义》中根据此段历史描写关羽斩文丑的故事，并广泛流传于后世。"),table);
            add(new Humans("张昭","吴","男","156","236","徐州彭城",R.drawable.zhangzhao,"东汉末年，张昭为避战乱而南渡至扬州。孙策创业时，任命其为长史、抚军中郎将，将文武之事都委任于张昭。孙策临死前，将其弟孙权托付给张昭，张昭率群僚辅立孙权，并安抚百姓、讨伐叛军，帮助孙权稳定局势。"),table);
            add(new Humans("司马昭","魏","男","211","265","河内温县",R.drawable.simazhao,"司马昭早年随父抗击蜀汉，多有战功。累官洛阳典农中郎将，封新城乡侯。正元二年（255年），继兄司马师为大将军，专揽国政。甘露五年（260年），魏帝曹髦被弑杀，司马昭立曹奂为帝。景元四年（263年），分兵遣钟会、邓艾、诸葛绪三路灭亡蜀汉，受封晋公。次年，进爵晋王。"),table);
            add(new Humans("曹植","魏","男","192","232","沛国谯县",R.drawable.caozhi,"曹植是三国时期著名文学家，作为建安文学的代表人物之一与集大成者，[2]  他在两晋南北朝时期，被推尊到文章典范的地位。其代表作有《洛神赋》《白马篇》《七哀诗》等。后人因其文学上的造诣而将他与曹操、曹丕合称为“三曹”。其诗以笔力雄健和词采画眉见长，留有集三十卷，已佚，今存《曹子建集》为宋人所编。曹植的散文同样亦具有“情兼雅怨，体被文质”的特色，加上其品种的丰富多样，使他在这方面取得了卓越的成就。南朝宋文学家谢灵运有“天下才有一石，曹子建独占八斗”的评价。文学批评家钟嵘亦赞曹植“骨气奇高，词彩华茂，情兼雅怨，体被文质，粲溢今古，卓尔不群。”[3]  并在《诗品》中把他列为品第最高的诗人。王士祯尝论汉魏以来二千年间诗家堪称“仙才”者，曹植、李白、苏轼三人耳。\n"),table);
            add(new Humans("王允","群","男","137","192","太原祁",R.drawable.wangyun,"东汉末年大臣。王允出身官宦世家。他十九岁就开始任公职，壮年时任豫州刺史。因为在和中常侍张让的斗争中失败，王允被迫去官隐居，在中平六年，何进掌权之后重新出仕，历任从事中郎和河南尹。在何进被宦官诛杀，董卓掌权时，他已经代替杨彪成为了司徒兼尚书令。身为地方官勤政爱民，由于朝廷腐败而被迫在此为官，从而密谋刺杀董卓。董卓死后，王允与吕布共执朝政，但是董卓余党李傕、郭汜、樊稠等率军攻破长安，吕布出逃，王允被处死，时年56岁。"),table);
            add(new Humans("凌统","吴","男","189","237","吴郡馀杭",R.drawable.lingtong,"三国时期吴国名将。凌操之子，少有名盛，为人有国士之风，多次战役中表现出色，官至偏将军。被陈寿盛赞为“江表之虎臣”[1]  。"),table);
            add(new Humans("曹操","魏","男","155","220","沛国谯县",R.drawable.caocao,"东汉末年，天下大乱，曹操以汉天子的名义征讨四方，对内消灭二袁、吕布、刘表、马超、韩遂等割据势力，对外降服南匈奴、乌桓、鲜卑等，统一了中国北方，并实行一系列政策恢复经济生产和社会秩序，扩大屯田、兴修水利、奖励农桑、重视手工业、安置流亡人口、实行“租调制”，从而使中原社会渐趋稳定、经济出现转机。[3]  黄河流域在曹操统治下，政治渐见清明，经济逐步恢复，阶级压迫稍有减轻，社会风气有所好转。曹操在汉朝的名义下所采取的一些措施具有积极作用"),table);
            add(new Humans("孙权","吴","男","182","252","吴郡富春",R.drawable.sunquan,"孙权的父亲孙坚和兄长孙策，在东汉末年群雄割据中打下了江东基业。建安五年（200年），孙策遇刺身亡，孙权继之掌事，成为一方诸侯。建安十三年（208年），与刘备建立孙刘联盟，并于赤壁之战中击败曹操，奠定三国鼎立的基础。建安二十四年（219年），孙权派吕蒙成功袭取刘备的荆州，使其领土面积大大增加。"),table);
            add(new Humans("诸葛亮","蜀","男","181","234","徐州琅琊阳都",R.drawable.zhugeliang,"早年随叔父诸葛玄到荆州，诸葛玄死后，诸葛亮就在隆中耕种。[3-5]  后刘备三顾茅庐请出，辅佐刘备建立蜀汉。蜀汉建立后，诸葛亮被封为丞相、武乡侯，对内抚百姓，示仪轨，约官职，从权制，开诚心，布公道，对外联吴抗魏，为实现兴复汉室的政治理想，数次北伐，但因各种不同因素而失败，最后于蜀汉建兴十二年（234年）病逝于五丈原，享年54岁。刘禅追谥其为忠武侯，后世常以武侯、诸葛武侯尊称诸葛亮。东晋政权因其军事才能特追封他为武兴王。"),table);
            add(new Humans("司马懿","魏","男","179","251","河内郡温县孝敬里",R.drawable.simayi,"司马懿曾任曹魏的大都督、大将军、太尉、太傅，是辅佐了魏国三代的托孤辅政之重臣，后期成为掌控魏国朝政的权臣。善谋奇策，多次征伐有功，其中最显著的功绩是两次率大军成功抵御诸葛亮北伐和远征平定辽东。对屯田、水利等农耕经济发展有重要贡献。73岁去世，辞郡公和殊礼，葬于首阳山。谥号宣文；次子司马昭封晋王后，追谥司马懿为宣王；司马炎称帝后，追尊司马懿为宣皇帝，庙号高祖"),table);
            add(new Humans("周瑜","吴","男","175","210","庐江舒",R.drawable.zhouyu,"周瑜少与孙策交好，21岁起随孙策奔赴战场平定江东，后孙策遇刺身亡，孙权继任，周瑜将兵赴丧，以中护军的身份与长史张昭共掌众事。建安十三年 （208年），周瑜率军与刘备联合，于赤壁之战中大败曹军，由此奠定了“三分天下”的基础。建安十四年（209年），拜偏将军领南郡太守。建安十五年（210年）病逝于巴丘，年仅36岁。"),table);
            add(new Humans("董卓","群","男","？","192","陇西临洮",R.drawable.dongzhuo,"董卓成长于凉州，好结交羌人。汉桓帝末年，董卓被征召为羽林郎，后又为中郎将张奂部下作军司马，讨伐汉阳羌人，董卓作战粗猛有谋，力建战功。又先后参与镇压黄巾起义、凉州之乱等战役，颇著威名。中平六年（189年），受大将军何进、司隶校尉袁绍所召，率军进京讨伐十常侍。不久令其弟董旻联合吴匡杀掉上司何苗，又招揽吕布杀掉丁原，很快就吞并了附近两大军阀兵力。随后董卓废少帝，立刘协即位（是为汉献帝），且不久就弑害了少帝及何太后，专断朝政。献帝初平元年（190年），袁绍联合关东各地刺史、太守，爆发董卓讨伐战。初平二年（191年），董卓被孙坚击败，退守长安。"),table);
            add(new Humans("吕布","群","男","？","198","五原郡九原县",R.drawable.lvbu,"兴平元年（194年），吕布趁曹操攻打陶谦时与陈宫等叛乱，占据濮阳，但是两年间被曹操击败转而去依附徐州刘备，又趁刘备与袁术作战时袭取了徐州，与刘备和好一阵又相互攻伐一阵。期间，以辕门射戟化解刘备与纪灵的争斗。建安三年（198年），吕布先后击败刘备与夏侯惇[dūn]后，曹操亲自出马征讨吕布，水淹下邳，吕布被部下叛变，城破被俘，被处死。"),table);
            add(new Humans("关羽","蜀","男","？","220","河东郡解县",R.drawable.guanyu,"赤壁之战后，刘备助东吴周瑜攻打南郡曹仁，别遣关羽绝北道，阻挡曹操援军，曹仁退走后，关羽被刘备任命为襄阳太守。刘备入益州，关羽留守荆州。建安二十四年，关羽围襄樊，曹操派于禁前来增援，关羽擒获于禁，斩杀庞德，威震华夏，曹操曾想迁都以避其锐。后曹操派徐晃前来增援，东吴吕蒙又偷袭荆州，关羽腹背受敌，兵败被杀。"),table);
            add(new Humans("赵云","蜀","男","？","229","常山真定",R.drawable.zhaoyun,"汉末军阀混战，赵云受本郡推举，率领义从加入白马将军公孙瓒。期间结识了汉室皇亲刘备，但不久之后，赵云因为兄长去世而离开。赵云离开公孙瓒大约七年后，在邺城与刘备相见，从此追随刘备。赵云跟随刘备将近三十年，先后参加过博望坡之战、长坂坡之战、江南平定战，独自指挥过入川之战、汉水之战、箕谷之战，都取得了非常好的战果。除了四处征战，赵云还先后以偏将军任桂阳太守，以留营司马留守公安，以翊军将军督江州。除此之外，赵云于平定益州时引霍去病故事劝谏刘备将田宅归还百姓，又于关羽张飞被害之后劝谏刘备不要伐吴，被后世赞为有大臣局量的儒将，甚至被认为是三国时期的完美人物。"),table);
            add(new Humans("张飞","蜀","男","？","221","幽州涿郡",R.drawable.zhangfei,"三国时期蜀汉名将。刘备长坂坡败退，张飞仅率二十骑断后，据水断桥，曹军没人敢逼近；与诸葛亮、赵云扫荡西川时，于江州义释严颜；汉中之战时又于宕渠击败张郃，对蜀汉贡献极大，官至车骑将军、领司隶校尉，封西乡侯，后被范强、张达刺杀。后主时代追谥为“桓侯”。在中国传统文化中，张飞以其勇猛、鲁莽、嫉恶如仇而著称，虽然此形象主要来源于小说和戏剧等民间艺术，但已深入人心。"),table);

        }
        cursor.close();

    }

}
